{
    "items": [
        {
            "snippet": {
                "title": "Spider-Man: Across the spider-Verse",
                "subtitle": "Miles morales in trouble",
                "thumbnails": {
                    "high": {
                        "url": "/static/spider-man2.jpg"
                    }
                },
                "publishTime": "June 2, 2023",
                "description":  "Miles Morales catapults across the Multiverse, where he encounters a team of Spider-People charged with protecting its very existence. When the heroes clash on how to handle a new threat, Miles must redefine what it means to be a hero."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/shW9i6k8cB0"
            }
        },
        {
            "snippet": {
                "title": "Zootopia",
                "subtitle": "Bunny Cop Solves City Mystery",
                "thumbnails": {
                    "high": {
                        "url": "/static/zootopia.jpeg"
                    }
                },
                "publishTime": "March 4, 2016",
                "description": "Zootopia is an animated comedy-adventure film set in a bustling city where animals of all species live together. Judy Hopps, a determined bunny police officer, teams up with a sly fox named Nick Wilde to solve a mysterious case and prove that anyone can be anything."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/u-vHrjoO6n4"
            }
        },
        {
            "snippet": {
                "title": "Coco",
                "subtitle": "Musical Journey in the Land of the Dead",
                "thumbnails": {
                    "high": {
                        "url": "/static/coco.jpg"
                    }
                },
                "publishTime": "October 27, 2017",
                "description": "Coco follows the story of Miguel, a young boy with a passion for music who finds himself in the colorful Land of the Dead during the Mexican holiday of Día de Muertos. He embarks on a journey to uncover the truth about his family's past and the importance of remembering one's roots."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/Ga6RYejo6Hk"
            }
        },
        {
            "snippet": {
                "title": "Mulan",
                "subtitle": "Warrior's Quest for Identity",
                "thumbnails": {
                    "high": {
                        "url": "/static/mulan.jpeg"
                    }
                },
                "publishTime": "March 19, 2020",
                "description": "Mulan is a 1998 Disney animated film set in ancient China. It follows Mulan, a courageous young woman who disguises herself as a man to join the army and protect her family. Through bravery and determination, she proves her worth as a warrior and learns the importance of staying true to herself."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/HKH7_n425Ss"
            }
        },
        {
            "snippet": {
                "title": "Big Hero 6",
                "subtitle": "High-Tech Heroes Protect San Fransokyo",
                "thumbnails": {
                    "high": {
                        "url": "/static/bighero-6.jpeg"
                    }
                },
                "publishTime": "November 7, 2014",
                "description": "Big Hero 6 is an action-packed film about a young robotics prodigy named Hiro Hamada and his inflatable healthcare companion, Baymax. Together with a group of friends, they form a high-tech superhero team to battle a mysterious villain and protect their city, San Fransokyo."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/d2S8D_SCAJY"
            }
        },
        {
            "snippet": {
                "title": "Tangled",
                "subtitle": "Rapunzel's Tower Escape Adventure",
                "thumbnails": {
                    "high": {
                        "url": "/static/tangled.jpg"
                    }
                },
                "publishTime": "November 24, 2010",
                "description": "Tangled is a reimagining of the classic fairy tale of Rapunzel. The film follows the adventurous journey of Rapunzel, a spirited young woman with 70 feet of magical golden hair, as she escapes her tower and embarks on a quest to discover the outside world."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/DLpXhJZ804c"
            }
        },
        {
            "snippet": {
                "title": "The Lion King",
                "subtitle": "Simba's Journey to Reclaim the Throne",
                "thumbnails": {
                    "high": {
                        "url": "/static/lion-king.jpeg"
                    }
                },
                "publishTime": "July 19, 2019",
                "description": "The Lion King is a photorealistic CGI remake of Disney's animated classic. It tells the tale of Simba, a young lion cub who must embrace his destiny as the rightful king of the Pride Lands and confront his past to bring harmony back to the animal kingdom."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/eHcZlPpNt0Q"
            }
        },
        {
            "snippet": {
                "title": "Frozen",
                "subtitle": "Sisterly Bond Melts Frozen Heart",
                "thumbnails": {
                    "high": {
                        "url": "/static/frozen.jpeg"
                    }
                },
                "publishTime": "November 27, 2013",
                "description": "Frozen is a heartwarming tale of two royal sisters, Elsa and Anna. Elsa possesses magical powers to control ice and snow, but when her abilities inadvertently plunge the kingdom into eternal winter, Anna embarks on a journey to bring her sister back and mend their bond."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/FLzfXQSPBOg"
            }
        },
        {
            "snippet": {
                "title": "Toy Story",
                "subtitle": "Toys Unite, Face New Challenges",
                "thumbnails": {
                    "high": {
                        "url": "/static/toy-story.jpg"
                    }
                },
                "publishTime": "November 22, 1995",
                "description": "In Toy Story 4, Woody and the gang encounter new challenges as they welcome Bonnie's creation, Forky, who struggles with his identity. While guiding Forky, Woody reunites with Bo Peep, discovering a life beyond being a toy. However, they face a sinister antique doll, Gabby Gabby, who seeks Woody's voice box. Amidst humor and friendship, the toys embark on an adventure that prompts them to question their purpose. Throughout their journey, they learn valuable lessons about loyalty, self-discovery, and the true meaning of being a toy. With heartwarming moments and engaging twists, Toy Story 4 continues to captivate audiences of all ages."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/wmiIUN-7qhE"
            }
        },
        {
            "snippet": {
                "title": "Moana",
                "subtitle": "Polynesian Princess Sets Sail",
                "thumbnails": {
                    "high": {
                        "url": "/static/moana.jpeg"
                    }
                },
                "publishTime": "November 23, 2016",
                "description": "Moana follows the adventures of a spirited Polynesian princess named Moana. Eager to save her island and its people, Moana sets sail across the ocean to find the demigod Maui and restore the heart of Te Fiti, rekindling her ancestors' voyaging legacy."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/LKFuXETZUsI"
            }
        },
        {
            "snippet": {
                "title": "Aladdin",
                "subtitle": "Street Rat's Magical Adventure",
                "thumbnails": {
                    "high": {
                        "url": "/static/aladdin.jpg"
                    }
                },
                "publishTime": "May 24, 2019",
                "description": "Aladdin, a street-smart young man, finds a magical lamp and unleashes the powerful Genie. With the Genie's help, Aladdin woos Princess Jasmine and battles the wicked sorcerer Jafar to save the kingdom of Agrabah."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/eTjHiQKJUDY"
            }
        },
        {
            "snippet": {
                "title": "Finding Nemo",
                "subtitle": "Father's Quest to Find His Son",
                "thumbnails": {
                    "high": {
                        "url": "/static/nemo.jpg"
                    }
                },
                "publishTime": "May 30, 2003",
                "description": "Finding Nemo follows Marlin, a clownfish, as he embarks on a journey across the ocean to find his son, Nemo, who was captured by a diver and placed in a fish tank in a dentist's office."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/2zLkasScy7A"
            }
        },
        {
            "snippet": {
                "title": "Brave",
                "subtitle": "Princess Defies Tradition",
                "thumbnails": {
                    "high": {
                        "url": "/static/brave.jpg"
                    }
                },
                "publishTime": "June 22, 2012",
                "description": "Brave follows Merida, a skilled archer and headstrong princess, as she defies tradition and seeks to change her fate. Her actions inadvertently unleash chaos, and she must use her courage and skills to undo a curse."
            },
            "id": {
                "videoId": "https://www.youtube.com/embed/6CKcqIahedc"
            }
        }
    ]
}